[
    {
        "id": 1,
        "title": "Rug Rescues🛟, Rug No More. Contract audits, migrations and more, how to bring peace to victims of rugged projects.",
        "image": "images/blog/blog-1.png",
        "text": "Dustin Turska",
        "largeImage": "images/blog/blog-1.png",
        "author": [
            "Dustin Turska"
        ],
        "date": "Nov 26, 2022",
        "view": "70 views",
        "categories": [
            "Rugs",
            "Contracts",
            "NFT Projects"
        ],
        "excerpt": "Because at the end of the day, it's the community that brings in the majority of outside interest and value to a project.",
        "body": [
            "<p>It may not be much, but we have at least done something! That’s right, we have decided to take a stand, and give community members of rugged projects, the ability to truly take back the project. There is a community out there that I for some reason became attached to. The Ugly Muck Yacht Club. Now, the name says it all, they are muckin ugly, but something about them sparked my inner Degen. </p><p>The Ugly Muck YC or just Mucks, for short, is a 10k piece pfp collection that launch in late August 2022. Now I’m not 100% on the full details, but a short time after, the founder(s) decided they were done and handed the contract over to the community. Fast forward a few weeks, and Aiden (CTO of KronicLabz) introduced me to these ugly little things, and I tell ya, I loved them! After securing a decent bag, roughly 100 or so, I began to instantly take note of the family like vibe all involved gave off. Also, around that time, I began to make a startling discovery. Yes, the community had the contract turned over, and yes, the founders had no way of controlling that, however, they still had their hold on the project. You see, these pfp rug projects typically have a team mint, or a reserve of NFTs for the founders and team. Now you can imagine given the fact these NFTs are of no cost to the team, it’s quite easy to list several hundred for pennies on the dollar and make a nice little stack of cash, even after leaving the project. </p><p> This was not ok, these communities needed a way to ensure they had 100% control, thus Rug Rescues🛟 was born. A dual partnership between us here at KronicLabz and our friends over at LordLabz, we created a contract that allows community members of rugged projects, the ability to migrate to a new community owned contract, while retaining the token id AND traits which they minted. The best part of it all, is it can blacklist both the founder’s wallet addresses and individual token id's insuring if the founders and team wanted to continue dropping the floor, they would have to buy back into the new contract first. Rug Rescues🛟services have already been ordered by the Pudgy Penguin YC and will be available exclusively through the Aura NFT Exchange in the coming weeks. </p><p>It may not be much, but it’s a whole lot more that not doing anything about these rugging founders. Because at the end of the day, it's the community that brings in most of the outside interest and value to a project. </p><p>Ugly Muck Wrapper Dapp https://uglymuckinwrapper.netlify.app </p> <p> Opensea collection(old) https://opensea.io/collection/umyc </p><p> Wrapped Muck collection https://opensea.io/collection/wrapped-mucks </p><p>Twitter https://twitter.com/MuckClub </p><p>Discord https://t.co/qqSS5OXr7L </p>"
        ],
        "tags": [
            "Rugs",
            "Aura NFT Exchange",
            "LordLabz",
            "KronicLabz LLC",
            "Contracts",
            "NFT",
            "Projects",
            "Founders",
            "Bad Actors",
            "Community",
            "Rug Rescues",
            "Rug No More"
        ]
    },
    {
        "id": 2,
        "title": "KronicKatz Announces Their Upcoming Updates and Partnerships Focusing on the Growth of the Project",
        "image": "images/blog/kronickatz.png",
        "text": "Dustin Turska",
        "largeImage": "images/blog/kronickatz.png",
        "author": [
            "Yahoo Finance"
        ],
        "date": "January 06, 2022 20:00 ET | Source: KronicKatz",
        "view": "15k views",
        "categories": [
            "KronicKatz",
            "Metaversity",
            "NFT Projects"
        ],
        "excerpt": "Metaversity.",
        "body": [
            "<p>KronicKatz has been extremely focused on developing its NFT platform. As the project developers realize the extent of the competition within the current digital market, KronicKatz has made sure that their idea of building, developing, and teaching blockchain, crypto, and NFT tech and their assorted system is carried out to perfection. Talking about how KronicKatz came into development under a set of distinctive goals and objectives, the platform presents the first Metaversity of the digital world. Not only does the project target NFTs and their development, but it also believes in teaching users the basic concepts of crypto, blockchain and the functions within. For this, KronicKatz is proud to present its first and metaverse-based educational platform. With such distinctive and dignified objectives in the digital world, KronicKatz is surely here to make an everlasting statement that would lead them into the world's most popular NFT platforms. The concept of 'Metaversity' seems quite confusing for many NFT users in the digital fraternity. As an answer to this query, KronicKatz aims to educate and make people aware of how to safely navigate, interact and invest on the blockchain. With a step-by-step hands-on learning environment, participants will be guided through a set of basic classes that will allow even the earliest of crypto investors to enter this space as safely and as educated as possible.</p><p>KronicKatz has been building its platform simultaneously while working on the 'Metaversity' project. There have been a lot of considerable updates that the project has successfully countered. As the project builds up the passion and curiosity of NFT users with its objectives, KronicKatz Metaversity has successfully launched public minting of their NFTs KronicKatz with a mint price of 0.03 ETH. These NFTs will later be used as a form of tuition for access to the advanced level classes provided by the Metaversity. This gives holders of the NFT the ability to gain a return on their investment by renting the NFT to the general public at a rate of nearly $8,000 per year in some cases. The holder will retain 80% of the fee paid to them, the other 20% will go back to the Metaversity and be delegated accordingly.</p><p>KronicKatz has introduced a variety of updates related to their project's details and operations. As Dustin Turska, the founder and creator of KronicKatz, introduced himself as the proud owner of this project; the world also came to know about how his wife, Haley Turska, leading the first-ever kid-friendly NFT marketplace featuring a safe environment under controlled conditions for guiding parents into helping their children provide input across a creative NFT environment. The project officially announced its goal to become the 'first decentralized educational platform featuring access for kids and adults globally.'</p><p>While focusing on the Metaversity updates, KronicKatz has successfully initiated their free blockchain education classes across the Discord channel. Following this, the developers are encouraged to develop a VR-based specialized teaching environment to build a distinctive environment for teaching students. To ensure successful coverage of all desired goals and updates, KronicKatz has partnered officially with AstroZeroNFT, the marketplace where NFT project production and education will officially be held ElonOne, the native token of AstroZero, gasless NFT marketplace, and Blue Chimps, the welcoming community for those first onboard into the crypto-space. Together, they form the Super community who aims to make defi and NFTs a globally accepted currency, and empowerment to the NFT artist and community. </p><p>To continue this exponential growth across the digital fraternity, KronicKatz is searching for volunteers to help lead instructions and design a curriculum that would be used for teaching users about NFT platforms. The project also focuses on building up partnerships in different fields for driving the operations and development of the platform, along with providing different teaching fields and guest speaker positions.</p><p>About the company:</p><p>KronicKatz is an NFT platform built to 'teach' users to move into a decentralized world. The project purposefully builds a platform that would provide users with NFT art to buy and hold and teach users of the initial concepts of blockchain technology. KronicKatz believes in building an inclusive community focused on a strong digital ecosystem, which can only come through the basic elements of teaching. </p>"
        ],
        "tags": [
            "KronicKatz",
            "KronicLabz LLC",
            "Metaversity",
            "web3",
            "VR",
            "Education",
            "IRL",
            "Community"
        ]
    },
    {
        "id": 3,
        "title": "KronicKatz to reopen mint to close out the year.",
        "image": "images/blog/blog-02.jpg",
        "text": "Dustin Turska",
        "largeImage": "images/blog/blog-02.jpg",
        "author": [
            "Dustin Turska"
        ],
        "date": "December 1, 2022 07:00 CST | Source: KronicKatz",
        "view": "15k views",
        "categories": [
            "KronicKatz",
            "Metaversity",
            "NFT Projects",
            "NFT",
            "KronicLabz LLC",
            "thirdweb"
        ],
        "excerpt": "NFT MultiVault Staking Contract.",
        "body": [
            "January 10th 2023 marks the 1 year anniversary of the launch of KronicKatz NFT and to mark the special occasion, the founders, Dustin, Matt, and Jimmy, have decided to reopen the mint at a reduced rate of .01 in attempts to start off the new year with a decent marketing budget for the project. To date, the KronicKatz have minted nearly 3500 of a 10000 piece collection, leaving roughly 6500 NFTs left to be minted. <p></p>The idea is to spark interest back into the collection before the new year, and to raise funds to start out the new year strong. In addition to the reduced mint, KronicLabz LLC will be introducing the new MultiVault Staking contract. The contract, released on our partner platform, thirdweb will allow not only KronicKatz holders to earn $MTEC token, but partner projects as well.<p></p>Amongst those partners include:<p></p>Mutant ApeWife twitter @Mutantapewife<p></p>Bored Ape Pixel Club twitter @BoredApePixelCl<p></p>Swaggy Lions twitter @SWAGGYLIONSCLUB<p></p>Ugly Muck YC twitter @MuckClub<p></p>Zombeze of Enlightenment twitter @cryptozombeze<p></p>CryptoDoodez <p></p>These are just a few of the many projects that will be able to create their own vault and stake earning $MTEC. <p></p>The fun will kick off this Saturday at 11:00am cst in twitter spaces  graciously hosted by West Toast @WCCN2022"
        ],
        "tags": [
            "KronicKatz",
            "KronicLabz LLC",
            "thirdweb",
            "web3",
            "VR",
            "NFT Staking",
            "IRL",
            "Community"
        ]
    }
]