[
    {
        "id": 1,
        "title": "Rug Rescues🛟, Rug No More.",
        "image": "images/blog/blog-1.png",
        "text": "Dustin Turska",
        "largeImage": "images/blog/blog-1.png",
        "author": ["Dustin Turska"],
        "date": "Nov 26, 2022",
        "view": "70 views",
        "categories": ["Rugs", "Contracts", "NFT Projects"],
        "excerpt": "Because at the end of the day, it's the community that brings in the majority of outside interest and value to a project.",
        "body":  ["<p>It may not be much, but we have at least done something! Thats right, we have decided to take a stand, and give community memebers of rugged projects, the ability to truly take back the project. There is a community out there that I for some reason became attatched to. The Ugly Much Yacht Club. Now, the name says it all, they are muckin ugly, but something about them sparked my inner degen. The Ugly Muck YC or just Mucks, for short, is a 10k piece pfp collection that launch in late August 2022. Now Im not 100% on the full details, but a short time after, the founder(s) decided they were done and handed the contract over to the community. Fast forward a few weeks, and Aiden (CTO of KronicLabz) introduced me to these ugly little things, and I tell ya, I loved them! After securing a decent bag, roughly 100 or so, I began to instantly take note of the family like vibe all involved gave off. Also around that time, I began to make a startling discovery. Yes, the community had the contract turned over, and yes the founders had no way of controlling that, however, they still had their hold on the project. You see, these pfp rug projects typically have a team mint, or a reserve of NFTs for the founders and team. Now you can imagine given the fact these NFTs are of no cost to the team, its quite easy to list several hundred for pennies on the dollar and make a nice little stack of cash, even after leaving the project. This was not ok, these communities needed a way to ensure they had 100% control, thus Rug Rescues🛟 was born. A duel partnership between us here at KronicLabz and our friends over at LordLabz, we created a contract that allows community members of rugged projects, the ability to migrate to a new community owned contract, while retaining the token id AND traits which they minted. The best part of it all, is it has the ability to blacklist both the founders wallet addresses and indivdual token id's insuring if the foudners and team wanted to continue dropping the floor, they would have to buy back into the new contract first. Rug Rescues🛟services have already been ordered by the Pudgy Penguin YC and will be available exclusively through the Aura NFT Exchange in the coming weeks. It may not be much, but its a whole lot more that not doing anything about these rugging foudners. Because at the end of the day, it's the community that brings in the majority of outside interest and value to a project. </p>"],
        "tags": ["Rugs", "Aura NFT Exchange", "LordLabz", "KronicLabz LLC", "Contracts", "NFT", "Projects", "Founders", "Bad Actors", "Community", "Rug Rescues", "Rug No More"]
    }
]